hotwired/app/controllers/library_books_controller.rb

SELECT "library_books".* FROM "library_books"
---
  def index
    @library_books = LibraryBook.all

INSERT INTO "library_books" ("title", "status", "description", "status_dat", "internal_info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Teste 123"], ["status", ""], ["description", ""], ["status_dat", nil], ["internal_info", ""], ["created_at", "2022-09-10 04:13:48.367006"], ["updated_at", "2022-09-10 04:13:48.367006"]]
---
  def create
    @library_book = LibraryBook.new(library_book_params)

    respond_to do |format|
      if @library_book.save

DELETE FROM "library_books" WHERE "library_books"."id" = ?  [["id", 21]]
---
  def destroy
    @library_book.destroy

SELECT "library_books".* FROM "library_books" WHERE "library_books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_library_book
      @library_book = LibraryBook.find(params[:id])